<?php 
/**
 * Шаблон для блока about_new
 * 
 * @package Clinic_Prime
 * @version 1.0.0
 * @param array $args Дополнительные аргументы для шаблона
 */

if (!defined('ABSPATH')) {
    exit;
}

?>

<section class="aboutSection">
    <?php
    $karina_link = $args['karina_link'];
    $natasha_link = $args['natasha_link'];
    $more_link = $args['more_link'];
    ?>
    <div class="container">
        <div class="aboutWrap">
            <div class="aboutLeftImg">
                <div class="aboutLeftImgWrap">
                    <img src="<?= THEME_URI; ?>/assets/img/main/new/img3.jpg" alt="" class="desktopImg">
                    <img src="<?= THEME_URI; ?>/assets/img/main/new/img3_mob.jpg" alt="" class="mobilepImg">
                    <div class="aboutLeftImgLabel label1">
                        <a href="<?= esc_url($karina_link ?: '#'); ?>" target="_blank">
                            <span>Карина Истомина</span>
                            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                                <path d="M21.5 5.01663C21.4485 5.48367 21.3454 6.00259 21.2424 6.46963C20.3665 10.6211 19.4907 14.7725 18.6148 18.924C18.5633 19.1835 18.5117 19.391 18.4087 19.5986C18.2026 19.9618 17.8935 20.0656 17.4813 19.9619C17.2237 19.91 17.0176 19.8062 16.8115 19.6505C15.472 18.6645 14.1839 17.6786 12.8444 16.6926C12.6898 16.5888 12.5867 16.5888 12.4322 16.7445C11.7624 17.3672 11.1441 18.0418 10.4744 18.6645C10.2167 18.924 9.95913 19.0797 9.59848 19.0278C9.34087 19.0278 9.18631 18.924 9.13479 18.6645C8.72262 17.3672 8.31045 16.1218 7.89827 14.8244C7.74371 14.4093 7.58915 13.9422 7.48611 13.5271C7.43458 13.3714 7.38306 13.2676 7.17697 13.2157C5.88893 12.8006 4.60089 12.3855 3.31284 12.0222C3.15828 11.9703 2.95219 11.9184 2.79763 11.8146C2.43698 11.6071 2.38545 11.2957 2.7461 10.9843C2.95219 10.7768 3.2098 10.673 3.51893 10.5692C5.27067 9.89458 7.02241 9.21997 8.77415 8.54536C12.5868 7.09235 16.3478 5.58745 20.1604 4.13444C20.212 4.13444 20.212 4.13444 20.2635 4.08255C20.9333 3.82308 21.5 4.18634 21.5 5.01663ZM9.59848 17.8342C9.65 17.7823 9.65001 17.7304 9.65001 17.7304C9.75305 16.7964 9.80457 15.8623 9.90762 14.9282C9.90762 14.7206 10.0107 14.5131 10.1652 14.3574C12.6383 12.126 15.1113 9.89458 17.5843 7.66317C17.7389 7.50749 17.8935 7.40371 18.0481 7.24803C18.0996 7.19614 18.2026 7.14424 18.1511 7.04046C18.0996 6.93667 17.9965 6.93667 17.8935 6.93667C17.6874 6.93667 17.5328 7.04046 17.3783 7.14425C14.3385 9.06429 11.2987 10.9843 8.25893 12.9563C8.10437 13.0601 8.05283 13.1638 8.10436 13.3714C8.46501 14.5131 8.82567 15.6547 9.23784 16.7964C9.34088 17.1077 9.49544 17.471 9.59848 17.8342Z" />
                            </svg>
                        </a>
                    </div>
                    <div class="aboutLeftImgLabel label2">
                        <a href="<?= esc_url($natasha_link ?: '#'); ?>" target="_blank">
                            <span>Наташа Каданцева</span>
                            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                                <path d="M21.5 5.01663C21.4485 5.48367 21.3454 6.00259 21.2424 6.46963C20.3665 10.6211 19.4907 14.7725 18.6148 18.924C18.5633 19.1835 18.5117 19.391 18.4087 19.5986C18.2026 19.9618 17.8935 20.0656 17.4813 19.9619C17.2237 19.91 17.0176 19.8062 16.8115 19.6505C15.472 18.6645 14.1839 17.6786 12.8444 16.6926C12.6898 16.5888 12.5867 16.5888 12.4322 16.7445C11.7624 17.3672 11.1441 18.0418 10.4744 18.6645C10.2167 18.924 9.95913 19.0797 9.59848 19.0278C9.34087 19.0278 9.18631 18.924 9.13479 18.6645C8.72262 17.3672 8.31045 16.1218 7.89827 14.8244C7.74371 14.4093 7.58915 13.9422 7.48611 13.5271C7.43458 13.3714 7.38306 13.2676 7.17697 13.2157C5.88893 12.8006 4.60089 12.3855 3.31284 12.0222C3.15828 11.9703 2.95219 11.9184 2.79763 11.8146C2.43698 11.6071 2.38545 11.2957 2.7461 10.9843C2.95219 10.7768 3.2098 10.673 3.51893 10.5692C5.27067 9.89458 7.02241 9.21997 8.77415 8.54536C12.5868 7.09235 16.3478 5.58745 20.1604 4.13444C20.212 4.13444 20.212 4.13444 20.2635 4.08255C20.9333 3.82308 21.5 4.18634 21.5 5.01663ZM9.59848 17.8342C9.65 17.7823 9.65001 17.7304 9.65001 17.7304C9.75305 16.7964 9.80457 15.8623 9.90762 14.9282C9.90762 14.7206 10.0107 14.5131 10.1652 14.3574C12.6383 12.126 15.1113 9.89458 17.5843 7.66317C17.7389 7.50749 17.8935 7.40371 18.0481 7.24803C18.0996 7.19614 18.2026 7.14424 18.1511 7.04046C18.0996 6.93667 17.9965 6.93667 17.8935 6.93667C17.6874 6.93667 17.5328 7.04046 17.3783 7.14425C14.3385 9.06429 11.2987 10.9843 8.25893 12.9563C8.10437 13.0601 8.05283 13.1638 8.10436 13.3714C8.46501 14.5131 8.82567 15.6547 9.23784 16.7964C9.34088 17.1077 9.49544 17.471 9.59848 17.8342Z"/>
                            </svg>
                        </a>
                    </div>
                </div>

            </div>
            <div class="aboutRightItems">
                <div class="abotInfoWrap">
                    <div class="aboutInfoLabel">О центре поведенческой терапии</div>
                    <h2 class="aboutInfoTitle">
                        Привет! Это Наташа Каданцева и Карина Истомина
                    </h2>
                    <div class="aboutInfoText">
                        <p>Вы знаете нас как ведущих программы о ментальном здоровье «Справиться Проще». Работа над проектом нас сильно изменила: помогла найти опоры и смысл жизни, понять, что можно жить стабильно и счастливо, а не страдать.</p>
                        <p>Со временем «Справиться Проще» расширилось до центра терапии, психоневрологической клиники и медиа. Сегодня мы уверенно можем сказать: у нас вы найдете комплексную поддержку ментального и физического здоровья, основанную на доказательных подходах.</p>
                    </div>
                    <div class="aboutInfoBut">
                        <a href="<?= esc_url($more_link ?: '#'); ?>" class="but butPrimary">Подробнее о нас</a>
                    </div>
                </div>
            </div>
        </div>
    </div>
</section>